In [1]:
pwd

'/Users/sukumarsubudhi/Downloads/Udemy_courses/Udemy_Jose_Portilla_Python_masterclass/03-Pandas'

In [2]:
ls

00-Series.ipynb
01-DataFrames.ipynb
02-Conditional-Filtering.ipynb
03-Useful-Methods.ipynb
04-Missing-Data.ipynb
04-Missing_data.ipynb
05-Groupby-Operations-and-MultiIndex.ipynb
06-Combining-DataFrames.ipynb
07-Text-Methods.ipynb
08-Time-Methods.ipynb
08-Time-Methods_1.ipynb
09-Inputs-and-Outputs.ipynb
10-Pivot-Tables.ipynb
11-Pandas-Project-Exercise .ipynb
12-Pandas-Project-Exercise-Solution.ipynb
RetailSales_BeerWineLiquor.csv
Sales_Funnel_CRM.csv
__pycache__/
example.csv
example.xlsx
hotel_booking_data.csv
movie_scores.csv
mpg.csv
my_excel_file.xlsx
new_file.csv
new_workbook.xlsx
newfile.csv
reshaping_pivot.png
sample_table.html
simple.html
tips.csv

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("RetailSales_BeerWineLiquor.csv")

In [5]:
df.head()

         DATE  MRTSSM4453USN
0  1992-01-01           1509
1  1992-02-01           1541
2  1992-03-01           1597
3  1992-04-01           1675
4  1992-05-01           1822

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
dtypes: int64(1), object(1)
memory usage: 5.4+ KB

In [9]:
df["DATE1"] = pd.to_datetime(df["DATE"])

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 340 entries, 0 to 339
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   DATE           340 non-null    object
 1   MRTSSM4453USN  340 non-null    int64
 2   DATE1          340 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.1+ KB

In [12]:
df

           DATE  MRTSSM4453USN      DATE1
0    1992-01-01           1509 1992-01-01
1    1992-02-01           1541 1992-02-01
2    1992-03-01           1597 1992-03-01
3    1992-04-01           1675 1992-04-01
4    1992-05-01           1822 1992-05-01
..          ...            ...        ...
335  2019-12-01           6630 2019-12-01
336  2020-01-01           4388 2020-01-01
337  2020-02-01           4533 2020-02-01
338  2020-03-01           5562 2020-03-01
339  2020-04-01           5207 2020-04-01

[340 rows x 3 columns]

In [13]:
df.to_clipboard()